'use client'


import Link from "next/link";
import { useActionState } from "react";


import { useState } from 'react';
//import { Button } from "@/components/ui/button";

export default function Policy() {
  
 
  


  return (
    <div className="flex items-center justify-center min-h-screen bg-black">
      <div className="p-6 bg-white rounded-lg shadow-lg w-2xl">
        
       <div className="p-4 ">
        <h2 className="mb-6 text-5xl font-bold font-weight: 700; text-center">นโยบายการคุ้มครองข้อมูลส่วนบุคคล </h2>
        <h2 className="mb-6 text-5xl font-bold font-weight: 700; text-center">(Privacy Policy)</h2>
       </div>
        <div className="p-2">
        <h5>เราเคารพสิทธิความเป็นส่วนตัวและความปลอดภัยของข้อมูลส่วนบุคคลของท่าน ขณะที่ท่านเข้าใช้บริการเว็บไซต์นี้ เราจะจัดการ ควบคุม และรักษาข้อมูลของท่านอย่างเหมาะสม เพื่อให้ท่านมั่นใจได้ว่าข้อมูลส่วนบุคคลที่ท่านให้ไว้จะถูกนำไปใช้ตรงตามวัตถุประสงค์และถูกต้องตามกฎหมาย</h5>
        <ol style={{ listStyleType: 'decimal' }}>
        <li>การเก็บรวบรวม ใช้ และ/หรือ เปิดเผยข้อมูลส่วนบุคคล
          <ol style={{ listStyleType: 'decimal', marginLeft: '20px',counterReset: 'subsection'  }}>
            <li> ข้อมูลที่บ่งชี้ตัวตน ได้แก่ ชื่อ-นามสกุล, ตำแหน่งงาน</li>
            <li> ข้อมูลการติดต่อ ได้แก่ หมายเลขโทรศัพท์, อีเมล</li>
            <li> ข้อมูลการเข้าใช้งานเว็บไซต์ ได้แก่ ประวัติการเข้าใช้งาน, ชื่อผู้ใช้, ชนิดของบราว์เซอร์, ประวัติการทำรายการ, Cookies หรือ Session</li>
          </ol>
        </li>
        <li>เราได้รับข้อมูลส่วนบุคคลของท่านจากช่องทางใด
          <ol style={{ listStyleType: 'decimal', marginLeft: '20px' }}>
            <li> เราได้รับข้อมูลส่วนบุคคลของท่านจากมหาวิทยาลัย ซึ่งมหาวิทยาลัยได้เก็บรวบรวมไว้</li>
            <li> เราได้รับข้อมูลส่วนบุคคลจากท่านโดยตรง จากการที่ท่านเข้าใช้บริการ ติดต่อ เยี่ยมชม ค้นหา ผ่านทางเว็บไซต์ อีเมล การติดต่อเจ้าหน้าที่หรือบุคลากรที่ดูแล รวมถึงช่องทางการสื่อสารอื่นๆ</li>
          </ol>
        </li>
        <li>วัตถุประสงค์ของการเก็บรวบรวม ใช้ และ/หรือ เปิดเผยข้อมูลส่วนบุคคล
          <ol style={{ listStyleType: 'decimal', marginLeft: '20px' }}>
            <h5>เพื่อประโยชน์ของท่านในการใช้บริการเว็บไซต์ เราจะจัดเก็บรวบรวมข้อมูลส่วนบุคคลของท่านตามระยะเวลาเท่าที่จำเป็นต่อวัตุประสงค์ โดยวัตถุประสงค์ของการจัดเก็บข้อมูลส่วนบุคคล มีดังนี้</h5>
            <li> เพื่อยืนยันตัวตนของท่าน</li>
            <li> เพื่อป้องกัน ตรวจสอบ รายการต่างๆ ที่อาจจะเกิดอาชญากรรมทางคอมพิวเตอร์และการฉ้อโกง</li>
            <li> เพื่อวิเคราะห์ ทบทวน พัฒนา และปรับปรุงการให้บริการ</li>
            <li> เพื่อการประมวลข้อมูล การทำสถิติ ศึกษาและวิเคราะห์ข้อมูล</li>
            <li> เพื่อใช้ในการติดต่อและสอบถามข้อมูลเพิ่มเติม</li>
            <li> เพื่อใช้ในการบันทึกรายการต่างๆ ในเว็บไซต์</li>

          </ol>
        </li>
        <li>ระยะเวลาในการจัดเก็บข้อมูล
          <ol style={{ listStyleType: 'decimal', marginLeft: '20px' }}>
            <h5>เราจะดำเนินการจัดเก็บข้อมูลส่วนบุคคลของท่านตลอดระยะเวลาที่ท่านยังปฏิบัติหน้าที่อยู่ในวิทยาลัยฯ แต่เราอาจจะยังคงเก็บข้อมูลส่วนบุคคลของท่านต่อไปหากเห็นว่ายังมีความจำเป็นหรือตามที่กฎหมายกำหนด</h5>
          </ol>
        </li>
        <li>สิทธิเกี่ยวกับข้อมูลส่วนบุคคลของท่าน
          <ol style={{ listStyleType: 'decimal', marginLeft: '20px' }}>
            <li> ท่านมีสิทธิเข้าถึงข้อมูล และขอรับสำเนาข้อมูลข้อมูลส่วนบุคคลของท่าน </li>
            <li> ท่านมีสิทธิในการแก้ไขข้อมูลที่เราเก็บรวบรวมไว้ ให้ถูกต้อง สมบูรณ์และเป็นปัจจุบัน </li>
            <li> ท่านมีสิทธิขอให้เราแก้ไขข้อมูลที่ไม่ถูกต้อง หรือเพิ่มเติมข้อมูลที่ไม่สมบูรณ์ได้ และอาจขอให้เราลบ หรือเปิดเผยแหล่งที่มาของข้อมูลของท่านในกรณีที่ไม่ได้ให้ความยินยอมได้ </li>
            <li> ท่านมีสิทธิคัดค้าน หรือระงับการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลบางประการของท่านได้</li>
            <li> ท่านมีสิทธิในการเพิกถอนความยินยอมในการประมวลผลข้อมูลส่วนบุคคลได้ตลอดระยะเวลาที่ข้อมูลส่วนบุคคลของท่านอยู่กับเรา เว้นแต่มีข้อจำกัดสิทธิในการเพิกถอนความยินยอมโดยกฎหมาย อย่างไรก็ตาม การที่ท่านเพิกถอนความยินยอมในการประมวลผลข้อมูลส่วนบุคคล อาจส่งผลให้เรามีข้อมูลไม่เพียงพอต่อการประมวลผลให้บรรลุวัตถุประสงค์ตามที่ได้แจ้ง และท่านอาจขาดความสะดวกในการได้รับบริการจากเรา</li>
          </ol>
        </li>
      </ol>
       </div>
       <div className="pb-8" >
        <h5>ท่านสามารถดูรายละเอียดเพิ่มเติมเกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคลของมหาวิทยาลัยศรีนครินทรวิโรฒ ได้ที่ <Link href="https://pdpa.swu.ac.th/">pdpa.swu.ac.th</Link></h5>
       </div> 
       <div className="pb-8">
        <h5>ระบบจองห้องเรียนและที่นั่งคอมพิวเตอร์ วิทยาลัยนวัตกรรมสื่อสารสังคม มหาวิทยาลัยศรีนครินทรวิโรฒ</h5>
       </div> 
       <div className="flex justify-end gap-1 jflex " >
        <Link href="/auth/registration" className="px-4 py-2 text-black transition duration-300 bg-white border border-black border-solid rounded outline-black hover:bg-black">ย้อนกลับ</Link> 
        <Link href="/auth/login_Student" className="px-4 py-2 text-white transition duration-300 bg-blue-900 rounded hover:bg-blue-700">สมัครสมาชิก</Link>
       </div>
      </div>
    </div>
  );
}