//app/policy/page.tsx
"use client"

import Link from "next/link";



export default function Policy() {
    return(
      <div className="w-full min-h-screen m-0 font-sans bg-gray-100">
       
        <div className="fixed inset-0 z-50 flex items-center justify-center bg-black bg-opacity-50 animate-fade-in">
          <div className="relative w-full max-w-4xl p-8 mx-4 bg-white rounded-lg shadow-2xl animate-slide-up max-h-[90vh] overflow-y-auto">
          

            {/* Pop-up Content */}
            <div className="text-center">
              <div className="p-4 ">
                <h2 className="mb-6 text-5xl font-bold font-weight: 700; text-center">นโยบายการคุ้มครองข้อมูลส่วนบุคคล </h2>
                <h2 className="mb-6 text-5xl font-bold font-weight: 700; text-center">(Privacy Policy)</h2>
              </div>
              <div className="p-2">
        <h5 className="mb-4">
        เราเคารพสิทธิความเป็นส่วนตัวและความปลอดภัยของข้อมูลส่วนบุคคลของท่าน ขณะที่ท่านเข้าใช้บริการเว็บไซต์นี้ เราจะจัดการ ควบคุม และรักษาข้อมูลของท่านอย่างเหมาะสม เพื่อให้ท่านมั่นใจได้ว่าข้อมูลส่วนบุคคลที่ท่านให้ไว้จะถูกนำไปใช้ตรงตามวัตถุประสงค์และถูกต้องตามกฎหมาย
      </h5>
        <ol >
        {/* 1. การเก็บรวบรวม ใช้ และ/หรือ เปิดเผยข้อมูลส่วนบุคคล */}
      <div className="mb-6">
        <h3  className="text-xl font-bold mb-2 text-left">1. การเก็บรวบรวม ใช้ และ/หรือ เปิดเผยข้อมูลส่วนบุคคล</h3>
        <ul className="list-disc ml-5 space-y-1 text-left">
          <li>ข้อมูลที่บ่งชี้ตัวตน ได้แก่ ชื่อ-นามสกุล, ตำแหน่งงาน</li>
          <li>ข้อมูลการติดต่อ ได้แก่ หมายเลขโทรศัพท์, อีเมล</li>
          <li>ข้อมูลการเข้าใช้งานเว็บไซต์ ได้แก่ ประวัติการเข้าใช้งาน, ชื่อผู้ใช้, ชนิดของบราว์เซอร์, ประวัติการทำรายการ, Cookies หรือ Session</li>
        </ul>
      </div>
        {/* 2. ช่องทางการรับข้อมูลส่วนบุคคลของท่าน */}
      <div className="mb-6">
        <h3  className="text-xl font-bold mb-2 text-left">2. ช่องทางการรับข้อมูลส่วนบุคคลของท่าน</h3>
        <ul className="list-disc ml-5 space-y-1 text-left">
          <li>เราได้รับข้อมูลส่วนบุคคลของท่านจากมหาวิทยาลัย ซึ่งมหาวิทยาลัยได้เก็บรวบรวมไว้</li>
          <li>เราได้รับข้อมูลส่วนบุคคลจากท่านโดยตรง จากการที่ท่านเข้าใช้บริการ ติดต่อ เยี่ยมชม ค้นหา ผ่านทางเว็บไซต์ อีเมล การติดต่อเจ้าหน้าที่หรือบุคลากรที่ดูแล รวมถึงช่องทางการสื่อสารอื่นๆ</li>
        </ul>
      </div>
        {/* 3. วัตถุประสงค์ของการเก็บรวบรวม ใช้ และ/หรือ เปิดเผยข้อมูลส่วนบุคคล */}
      <div className="mb-6">
        <h3  className="text-xl font-bold mb-2 text-left">3. วัตถุประสงค์ของการเก็บรวบรวม ใช้ และ/หรือ เปิดเผยข้อมูลส่วนบุคคล</h3>
        <p className="mb-2">
          เพื่อประโยชน์ของท่านในการใช้บริการเว็บไซต์ เราจะจัดเก็บรวบรวมข้อมูลส่วนบุคคลของท่านตามระยะเวลาเท่าที่จำเป็นต่อวัตถุประสงค์ โดยวัตถุประสงค์ของการจัดเก็บข้อมูลส่วนบุคคล มีดังนี้
        </p>
        <ul className="list-disc ml-5 space-y-1 text-left">
          <li>เพื่อยืนยันตัวตนของท่าน</li>
          <li>เพื่อป้องกัน ตรวจสอบ รายการต่างๆ ที่อาจจะเกิดอาชญากรรมทางคอมพิวเตอร์และการฉ้อโกง</li>
          <li>เพื่อวิเคราะห์ ทบทวน พัฒนา และปรับปรุงการให้บริการ</li>
          <li>เพื่อการประมวลข้อมูล การทำสถิติ ศึกษาและวิเคราะห์ข้อมูล</li>
          <li>เพื่อใช้ในการติดต่อและสอบถามข้อมูลเพิ่มเติม</li>
          <li>เพื่อใช้ในการบันทึกรายการต่างๆ ในเว็บไซต์</li>
        </ul>
      </div>
        {/* 4. ระยะเวลาในการจัดเก็บข้อมูล */}
      <div className="mb-6">
        <h3  className="text-xl font-bold mb-2 text-left">4. ระยะเวลาในการจัดเก็บข้อมูล</h3>
        <p>
          เราจะดำเนินการจัดเก็บข้อมูลส่วนบุคคลของท่านตลอดระยะเวลาที่ท่านยังปฏิบัติหน้าที่อยู่ในวิทยาลัยฯ แต่เราอาจจะยังคงเก็บข้อมูลส่วนบุคคลของท่านต่อไปหากเห็นว่ายังมีความจำเป็นหรือตามที่กฎหมายกำหนด
        </p>
      </div>
        {/* 5. สิทธิเกี่ยวกับข้อมูลส่วนบุคคลของท่าน */}
      <div className="mb-6">
        <h3  className="text-xl font-bold mb-2 text-left">5. สิทธิเกี่ยวกับข้อมูลส่วนบุคคลของท่าน</h3>
        <ul className="list-disc ml-5 space-y-1 text-left">
          <li>ท่านมีสิทธิเข้าถึงข้อมูล และขอรับสำเนาข้อมูลข้อมูลส่วนบุคคลของท่าน</li>
          <li>ท่านมีสิทธิในการแก้ไขข้อมูลที่เราเก็บรวบรวมไว้ ให้ถูกต้อง สมบูรณ์และเป็นปัจจุบัน</li>
          <li>ท่านมีสิทธิขอให้เราแก้ไขข้อมูลที่ไม่ถูกต้อง หรือเพิ่มเติมข้อมูลที่ไม่สมบูรณ์ได้ และอาจขอให้เราลบ หรือเปิดเผยแหล่งที่มาของข้อมูลของท่านในกรณีที่ไม่ได้ให้ความยินยอมได้</li>
          <li>ท่านมีสิทธิคัดค้าน หรือระงับการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลบางประการของท่านได้</li>
          <li>ท่านมีสิทธิในการเพิกถอนความยินยอมในการประมวลผลข้อมูลส่วนบุคคลได้ตลอดระยะเวลาที่ข้อมูลส่วนบุคคลของท่านอยู่กับเรา เว้นแต่มีข้อจำกัดสิทธิในการเพิกถอนความยินยอมโดยกฎหมาย อย่างไรก็ตาม การที่ท่านเพิกถอนความยินยอมในการประมวลผลข้อมูลส่วนบุคคล อาจส่งผลให้เรามีข้อมูลไม่เพียงพอต่อการประมวลผลให้บรรลุวัตถุประสงค์ตามที่ได้แจ้ง และท่านอาจขาดความสะดวกในการได้รับบริการจากเรา</li>
        </ul>
      </div>
      </ol>
       </div>
       <div className="pb-8" >
        <h5>ท่านสามารถดูรายละเอียดเพิ่มเติมเกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคลของมหาวิทยาลัยศรีนครินทรวิโรฒ ได้ที่ <Link href="https://pdpa.swu.ac.th/">pdpa.swu.ac.th</Link></h5>
        <h5>ระบบจองห้องเรียนและที่นั่งคอมพิวเตอร์ วิทยาลัยนวัตกรรมสื่อสารสังคม มหาวิทยาลัยศรีนครินทรวิโรฒ</h5>
       </div> 
              <Link 
            href="/auth/login"
            className="w-full px-6 py-3 text-white transition duration-300 bg-indigo-500 rounded-md hover:bg-indigo-600 focus:outline-none focus:ring-2 focus:ring-indigo-700 text-center block"
                >
            ย้อนกลับ
            </Link>
            </div>
          </div>
        </div>
      </div>
    );
}